# Задаем переменную CC (C Compiler), указывая, что для сборки мы используем компилятор gcc
CC = gcc

# Переменная CFLAGS хранит флаги компилятора, которые будут добавляться к каждой команде:
# -Wall -Wextra : Включает вывод всех предупреждений компилятора
# -pthread      : Подключает библиотеку POSIX-потоков
# -g            : Добавляет отладочные символы, чтобы программу можно было проверять через gdb или valgrind
CFLAGS = -Wall -Wextra -pthread -g

# Цель по умолчанию: если в консоли написать просто make, она начнет собирать цель bplus_tree
all: bplus_tree

# --- СБОРКА ОСНОВНОЙ ПРОГРАММЫ ---
# Правило создания итогового исполняемого файла bplus_tree
# Оно зависит от трех скомпилированных объектных (.o) файлов
bplus_tree: main.o bplus_tree.o wal.o
	$(CC) $(CFLAGS) -o bplus_tree main.o bplus_tree.o wal.o
# Эта команда начинается строго с клавиши Tab! выполняет линковку (связывание) объектных файлов в один исполняемый

# Правило компиляции main.o: Если изменятся файлы main.c, bplus_tree.h или wal.h, этот файл пересоберется
main.o: main.c bplus_tree.h wal.h
	$(CC) $(CFLAGS) -c main.c
# Флаг -c означает "только компиляция без линковки". Он превращает код в машинные инструкции (.o файл).

# Правило компиляции логики дерева. Зависит от исходника и заголовочных файлов.
bplus_tree.o: bplus_tree.c bplus_tree.h wal.h
	$(CC) $(CFLAGS) -c bplus_tree.c
# Компилируем алгоритмы дерева в объектный файл bplus_tree.o

# Правило компиляции работы с диском и журнала
wal.o: wal.c wal.h bplus_tree.h
	$(CC) $(CFLAGS) -c wal.c
# Компилируем функции mmap и WAL в объектный файл wal.o


# --- БЛОК ДЛЯ ТЕСТОВ ---
# Цель test вызывается командой make test. Зависит от тестов и логики программы (кроме main.o).
test: tests.o bplus_tree.o wal.o
	$(CC) $(CFLAGS) -o run_tests tests.o bplus_tree.o wal.o
# Линкуем исполняемый файл run_tests из объектного файла тестов и логики дерева

# Правило компиляции объектного файла с нашими тестами (assert)
tests.o: tests.c bplus_tree.h wal.h
	$(CC) $(CFLAGS) -c tests.c
# Компилируем исходник тестов


# --- ОЧИСТКА ---
# Цель clean вызывается командой make clean. Не зависит ни от каких файлов.
clean:
	rm -f *.o bplus_tree run_tests *.dat *.log
# Утилита rm удаляет (-f игнорирует ошибки отсутствия файлов) весь мусор:
# *.o (все объектные файлы), программы bplus_tree и run_tests, а также базы *.dat и логи *.log.